[{"word": "endemic", "definitionA": "natural to or characteristic of a specific people or place; native; indigenous: The group is committed to preserving the endemic folkways of their nation.The recession hit especially hard in countries where high unemployment is endemic.belonging exclusively or confined to a particular place: When traveling, he caught a fever endemic to the tropics.", "definitionB": null, "etymology": "First recorded in 1655–65;  from New Latin endēmicus,  equivalent to Greek éndēm(os)  “dwelling in a place, native, (of disease) endemic” (from en-  “within, in”  + dêm(os)  “people, district”) + Latin -icus  adjective suffix; see en-2, deme, -ic ", "example": "The group is committed to preserving the endemic folkways of their nation.", "synonym": null}, {"word": "dole", "definitionA": "a portion or allotment of money, food, etc., especially as given at regular intervals by a charity or for maintenance.a dealing out or distributing, especially in charity.", "definitionB": null, "etymology": "First recorded before 1000; Middle English dol, dal  “part, subdivision,” Old English dāl, gedāl  “sharing”; see origin at deal1", "example": "The last of the water was doled out to the thirsty crew.", "synonym": null}, {"word": "betide", "definitionA": "to happen to; come to; befall: Woe betide the villain!", "definitionB": null, "etymology": "First recorded in 1125–75, betide is from the Middle English  word betiden.See be-, tide2", "example": "Woe betide the villain!", "synonym": null}, {"word": "demiurge", "definitionA": "Philosophy. Platonism. the artificer of the world.(in the Gnostic and certain other belief systems) a supernatural being imagined as creating or fashioning the world in subordination to the Supreme Being,  and sometimes regarded as the originator of evil.(in many states of ancient Greece) a public official or magistrate.", "definitionB": null, "etymology": "First recorded in 1590–1600;  from Greek dēmiourgós  “a worker for the people, public worker, skilled worker,” equivalent to dḗmio(s)  “of the people, public” + -ergos  “a worker,” derivative of érgon work ", "example": null, "synonym": null}, {"word": "geodesy", "definitionA": "the branch of applied mathematics that deals with the measurement of the shape and area of large tracts of country, the exact position of geographical points, and the curvature, shape, and dimensions of the earth.", "definitionB": null, "etymology": "1560–70; <French géodésie<Greek geōdaisía, equivalent to geō-geo-  + daí(ein) to divide + -sia, variant of -ia-ia  (generalized from stems ending in t)", "example": null, "synonym": null}, {"word": "eudaemonic", "definitionA": "pertaining or conducive to happiness.pertaining to eudemonics  or eudemonism. ", "definitionB": null, "etymology": "From the Greek  word eudaimonikós, dating back to 1825–35. See eudemon, -ic", "example": null, "synonym": null}, {"word": "esoteric", "definitionA": "understood by or meant for only the select few who have special knowledge or interest; recondite: poetry full of esoteric allusions.belonging to the select few.", "definitionB": null, "etymology": "First recorded in 1645–55;  from Greek esōterikós  “inner,” equivalent to esṓter(os)  “inner” + -ikos -ic", "example": "poetry full of esoteric allusions.", "synonym": null}, {"word": "seminary", "definitionA": "a special school providing education in theology, religious history, etc., primarily to prepare students for the priesthood, ministry, or rabbinate.a school, especially one of higher grade.", "definitionB": null, "etymology": "1400–50; late Middle English:  seed plot, nursery <Latin sēminārium, equivalent to sēmin- (stem of sēmen) seed, semen  + -ārium-ary", "example": "a seminary of discontent.", "synonym": null}, {"word": "seminar", "definitionA": "a small group of students, as in a university, engaged in advanced study and original research under a member of the faculty and meeting regularly to exchange information and hold discussions.the gathering place of such a group.", "definitionB": null, "etymology": "1885–90, Americanism;<German <Latin sēmināriumseminary", "example": null, "synonym": null}, {"word": "lampoon", "definitionA": "a sharp, often virulent satire directed against an individual or institution; a work of literature, art, or the like, ridiculing severely the character or behavior of a person, society, etc.", "definitionB": null, "etymology": "First recorded in 1635–45;  from French lampon,  said to be noun use of lampons  “let us guzzle” (from a drinking song), imperative of lamper,  akin to laper  “to lap up,” from Germanic; see lap3", "example": "to lampoon important leaders in the government.", "synonym": null}, {"word": "premises", "definitionA": "a piece of land together with its buildings, esp considered as a place of businesslaw (in a deed, etc) the matters referred to previously; the aforesaid; the foregoingthe introductory part of a grant, conveyance, etc", "definitionB": null, "etymology": null, "example": null, "synonym": null}, {"word": "haggard", "definitionA": "having a gaunt, wasted, or exhausted appearance, as from prolonged suffering, exertion, or anxiety; worn: the haggard faces of the tired troops.Archaic. wild; wild-looking: haggard eyes.", "definitionB": null, "etymology": "First recorded in 1560–70;  originally, “wild female hawk”; see hag1, -ard", "example": "the haggard faces of the tired troops.", "synonym": null}, {"word": "oxymoron", "definitionA": "a figure of speech by which a locution produces an incongruous, seemingly self-contradictory effect, as in “cruel kindness” or “to make haste slowly.”", "definitionB": null, "etymology": "First recorded in 1650–60;  from Late Latin oxymorum,  from presumed Greek oxýmōron  (unrecorded), neuter of oxýmōros  (unrecorded) “sharp-dull,” equivalent to oxý(s)  “sharp” (see oxy-1) + mōrós  “dull” (see moron)", "example": null, "synonym": null}, {"word": "sycophant", "definitionA": "a self-seeking, servile flatterer; fawning parasite.", "definitionB": null, "etymology": "First recorded in 1530–40;  from Latin sȳcophanta,  from Greek sȳkophántēs  “informer,” from sŷko(n)  “fig” + phan-  (stem of phaínein  “to show”) + -tēs,  agent noun suffix", "example": null, "synonym": null}, {"word": "acrophobia", "definitionA": "an irrational or disproportionate fear of heights: I knew my acrophobia would keep me off of the competitive diving platforms, but I was surprised when walking the diving board three feet above the pool deck also terrified me.", "definitionB": null, "etymology": "First recorded in 1890–95; acro-, -phobia", "example": "I knew my acrophobia would keep me off of the competitive diving platforms, but I was surprised when walking the diving board three feet above the pool deck also terrified me.", "synonym": null}, {"word": "acronym", "definitionA": "a word formed from the initial letters or groups of letters of words in a set phrase or series of words and pronounced as a separate word, as Wac from Women's Army Corps,OPEC from Organization of Petroleum Exporting Countries, or loran from long-range navigation.initialism (def. 1). ", "definitionB": null, "etymology": "First recorded in 1940–45; acr-  + -onym", "example": "The committee's name has been acronymed MIKE.", "synonym": null}, {"word": "acropolis", "definitionA": "the citadel or high fortified area of an ancient Greek city.the Acropolis, the citadel of Athens and the site of the Parthenon.", "definitionB": null, "etymology": "From the Greek  word akrópolis, dating back to 1655–65. See acro-, -polis", "example": null, "synonym": null}, {"word": "acrophony", "definitionA": "the use of what was originally a logogram as a phonetic symbol for the initial sound of the word the logogram represented, as, in Semitic writing, the use of a picture of a shepherd's crook to represent the sound (l), the first sound of lamed, the Hebrew word for a shepherd's crook.the use of a word as the name of the alphabetic symbol representing the initial sound of that word.", "definitionB": null, "etymology": "First recorded in 1880–85; acro-  + -phony", "example": null, "synonym": null}, {"word": "acronychal", "definitionA": "occurring at sunset: the star has an acronychal rising", "definitionB": null, "etymology": "C16: from Greek akronychos at sunset, from acro- + nykh-, nyx night", "example": null, "synonym": null}, {"word": "acroparaesthesia", "definitionA": "pathol a persistent sensation of numbness and tingling in the hands and feet", "definitionB": null, "etymology": null, "example": null, "synonym": null}]