[{"word": "woozy", "definitionA": "stupidly confused; muddled; befuddled:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Queasy, dizzy, or disoriented<br>&nbsp;&nbsp;&nbsp;2. Intoxicated by drink or drugs<br>", "etymology": "An Americanism first recorded in 1895–1900; perhaps short for boozy-woozy, rhyming compound based on boozy", "example": "I’d never been to California at all, so of course in my imagination it was Eden, warm and woozy and comfortable.", "synonym": null}, {"word": "harry", "definitionA": "to harass, agitate, or trouble by or as if by repeated attacks; beleaguer:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To plunder, pillage, assault.<br>&nbsp;&nbsp;&nbsp;2. To make repeated attacks on an enemy.<br>&nbsp;&nbsp;&nbsp;3. To strip, lay waste, ravage.<br>&nbsp;&nbsp;&nbsp;4. To harass, bother or distress with demands, threats, or criticism.<br>", "etymology": "First recorded before 900; Middle English herien, Old English her(g)ian (derivative of here “army”); cognate with German verheeren, Old Norse herja “to harry, lay waste”", "example": "The rest of the dialogue is voiced too, including the inanimate objects that speak, such as Harry’s necktie.", "synonym": "attack"}, {"word": "astraphobia", "definitionA": "an irrational or disproportionate fear of thunder and lightning. Compare lilapsophobia.", "definitionB": "No definition found", "etymology": "First recorded in 1855–60 for spelling astrophobia in the obsolete sense “fear of stars,” and in 1870–75 for the spelling astraphobia in its current sense; from astro- ( def ) or Greek astra(pḗ) “lightning” + -phobia", "example": null, "synonym": null}, {"word": "lilapsophobia", "definitionA": "an irrational or disproportionate fear of tornadoes or hurricanes, or of the possibility that a less severe storm will develop into such catastrophic weather: generally considered a form of astraphobia. Compare astraphobia.", "definitionB": "No definition found", "etymology": "First recorded in 1975–80; from Greek laîlaps (inflectional stem laîlap- ) “violent storm, hurricane” + -o- ( def ) + -phobia ( def )", "example": null, "synonym": null}, {"word": "sibylline", "definitionA": "of, resembling, or characteristic of a sibyl; prophetic; oracular.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Of or pertaining to a sibyl or female oracle, especially the Cumaean Sibyl and the Sibylline Books.<br>&nbsp;&nbsp;&nbsp;2. (by extension) Having oracle-like predicting powers, clairvoyant.<br>&nbsp;&nbsp;&nbsp;3. Mysterious.<br>", "etymology": "First recorded in 1570–80; from Latin Sibyllīnus “pertaining to a sibyl”; sibyl, -ine 1", "example": "It is reported that a woman called Amalthæa, from a foreign country, came to Tarquin the Proud to sell nine sibylline books.", "synonym": null}, {"word": "feisty", "definitionA": "full of animation, energy, or courage; spirited; spunky; plucky:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Tenacious, energetic, spunky.<br>&nbsp;&nbsp;&nbsp;2. Belligerent; prepared to stand and fight, especially in spite of relatively small stature or some other disadvantage.<br>&nbsp;&nbsp;&nbsp;3. Easily offended and ready to bicker.<br>", "etymology": "An Americanism dating back to 1895–1900; feist + -y 1", "example": "Especially if it involves a band of feisty women who are both haunted and haunting.", "synonym": null}, {"word": "gob", "definitionA": "a mass or lump.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A lump of soft or sticky material.<br>&nbsp;&nbsp;&nbsp;2. The mouth.<br>&nbsp;&nbsp;&nbsp;3. Saliva or phlegm.<br>&nbsp;&nbsp;&nbsp;4. A sailor.<br>&nbsp;&nbsp;&nbsp;5. Waste material in old mine workings, goaf.<br>&nbsp;&nbsp;&nbsp;6. A whoopee pie.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To gather into a lump.<br>&nbsp;&nbsp;&nbsp;2. To spit, especially to spit phlegm.<br>&nbsp;&nbsp;&nbsp;3. To pack away waste material in order to support the walls of the mine.<br>", "etymology": "First recorded in 1350–1400; Middle English gobbe, variant of gobet “a mouthful, lump”; gobbet", "example": "As a sign that this might be true outside the lab also, researchers typically found more of the jelly-gob egg masses, signs of mating success, floating in pools where choruses kept more consistent pitches.", "synonym": "abundance"}, {"word": "implacable", "definitionA": "not to be appeased, mollified, or pacified; inexorable:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Not able to be placated or appeased.<br>&nbsp;&nbsp;&nbsp;2. Impossible to prevent or stop; inexorable, unrelenting, unstoppable.<br>&nbsp;&nbsp;&nbsp;3. Adamant; immovable.<br>", "etymology": "First recorded in 1375–1425; late Middle English word from Latin word implācābilis. See im- 2, placable", "example": "These implacable sentries and imperial and courtly surveillance robots and AIs are theoretically superior to the human beings who would otherwise be entrusted with these tasks.", "synonym": null}, {"word": "inscrutable", "definitionA": "incapable of being investigated, analyzed, or scrutinized; impenetrable.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who or that which is inscrutable; a person, etc. that cannot be comprehended.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Difficult or impossible to comprehend, fathom or interpret.<br>", "etymology": "First recorded in 1400–50; late Middle English word from Late Latin word inscrūtābilis. See in- 3, scrutable", "example": "Blind spots, communication breakdowns and incomprehensible secret selves may be endemic in this poetic rumination on things forever lost and inscrutable.", "synonym": null}, {"word": "behoove", "definitionA": "to be necessary or proper for, as for moral or ethical considerations; be incumbent on:", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To befit, to suit.<br>&nbsp;&nbsp;&nbsp;2. To be necessary for (someone).<br>&nbsp;&nbsp;&nbsp;3. To be in the best interest of; to benefit.<br>&nbsp;&nbsp;&nbsp;4. To be needful, meet or becoming.<br>", "etymology": "First recorded before 900; Middle English behoven, Old English behōfian “to need” ( behōf behoof + -ian infinitive suffix)", "example": "The priority here appears to be the cast’s safety and comfort—an impulse that would behoove some other franchises.", "synonym": "befit"}, {"word": "otiose", "definitionA": "being at leisure; idle; indolent.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having no effect.<br>&nbsp;&nbsp;&nbsp;2. Done in a careless or perfunctory manner.<br>&nbsp;&nbsp;&nbsp;3. Reluctant to work or to exert oneself.<br>&nbsp;&nbsp;&nbsp;4. Of a person, possessing a bored indolence.<br>&nbsp;&nbsp;&nbsp;5. Having no reason for being (raison d’être); having no point, reason, or purpose.<br>", "etymology": "First recorded in 1785–95; from Latin ōtiōsus “at leisure, inactive, undisturbed,” equivalent to ōti(um) “leisure, spare time” + -ōsus adjective suffix; -ose 1", "example": "There is no superfluous ornament in his orations, nothing tawdry, nothing otiose.", "synonym": null}, {"word": "parsimonious", "definitionA": "characterized by or showing parsimony; frugal or stingy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Exhibiting parsimony; sparing in the expenditure of money; frugal to excess.<br>&nbsp;&nbsp;&nbsp;2. Using a minimal number of assumptions, steps, or conjectures.<br>&nbsp;&nbsp;&nbsp;3. Not conceding many goals.<br>", "etymology": "First recorded in 1590–1600; parsimon(y) + -ious", "example": "Taken together, however, these traits result in an interpretation of these fossils that is far more parsimonious than any alternative hypothesis.", "synonym": null}, {"word": "ignominious", "definitionA": "marked by or attended with ignominy; discreditable; humiliating:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Marked by shame or disgrace.<br>", "etymology": "First recorded in 1375–1425; late Middle English word from Latin word ignōminiōsus. See ignominy, -ous", "example": "At the same time, other airplane programs, both commercial and military, were plagued with problems, and its effort to catch up with Elon Musk’s SpaceX program supplying astronaut-carrying capsules to NASA suffered repeated and ignominious failures.", "synonym": null}, {"word": "dastard", "definitionA": "a mean, sneaking coward.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A malicious coward; a dishonorable sneak.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To dastardize.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Meanly shrinking from danger, cowardly, dastardly.<br>", "etymology": "1400–50; late Middle English < ?.", "example": null, "synonym": "cad"}, {"word": "cad", "definitionA": "an ill-bred man, especially one who behaves in a dishonorable or irresponsible way toward women.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A low-bred, presuming person; a mean, vulgar fellow.<br>&nbsp;&nbsp;&nbsp;2. A person who stands at the door of an omnibus to open and shut it, and to receive fares; an idle hanger-on about innyards.<br>", "etymology": "First recorded in 1780–90; short for caddie (in the sense “a person who runs errands and does odd jobs”)", "example": "Lift Tickets: Adult three-day passes begin at around $200 (CAD), depending on whenyou visit.", "synonym": "boor"}, {"word": "craven", "definitionA": "cowardly; contemptibly timid; pusillanimous.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A coward.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To make craven.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Unwilling to fight; lacking even the rudiments of courage; extremely cowardly.<br>", "etymology": "1175–1225; Middle English cravant, cravaunde defeated < Old French craventé, past participle of cravanter to crush, overwhelm (< Vulgar Latin *crepantāre ), influenced by Middle English creaunt defeated ( recreant )", "example": "In that, her legacy is in very, very safe territory in a city otherwise occupied by craven opportunists.", "synonym": "chicken"}, {"word": "poltroon", "definitionA": "a wretched coward; craven.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An ignoble or total coward; a dastard; a mean-spirited wretch.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Cowardly.<br>", "etymology": "1520–30; earlier pultrowne, pultron, poultroone < Middle French poultron < Old Italian poltrone idler, coward, derivative of poltro foal < Vulgar Latin *pulliter, derivative of Latin pullus young animal; foal", "example": "Joe tried to grab him with the boathook, but it was useless, and the unhappy poltroon's body was whirled away.", "synonym": "coward"}, {"word": "recreant", "definitionA": "cowardly or craven.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Somebody who is recreant, who yields in combat; a coward or traitor.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Having admitted defeat and surrendered; defeated.<br>&nbsp;&nbsp;&nbsp;2. Unfaithful to someone, or to one's duties or honour; disloyal, false.<br>", "etymology": "1300–50; Middle English < Old French, adj. and noun use of present participle of recreire to yield in a contest, equivalent to re- re- + creire < Latin crēdere to believe", "example": "I had rather prove recreant to the oath I took before I realized the worth of the woman whose happiness I vowed to destroy.", "synonym": "apostate"}, {"word": "wimp", "definitionA": "a weak, ineffectual, timid person.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Acronym of window, icon, menu, pointer. (a graphical interface paradigm)<br>&nbsp;&nbsp;&nbsp;2. Acronym of window-icon-mouse program.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A hypothetical class of particle, proposed to explain the dark matter problem.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Someone who lacks confidence or courage, is weak, ineffectual, irresolute and wishy-washy<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To behave submissively.<br>&nbsp;&nbsp;&nbsp;2. To render wimpy.<br>", "etymology": "An Americanism dating back to 1915–20; origin uncertain; whimper", "example": "Was he so determined not to look like an angry black man that he ended up looking ... kind of like a wimp?", "synonym": "baby"}, {"word": "miscreant", "definitionA": "depraved, villainous, or base.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. One who has behaved badly, or illegally.<br>&nbsp;&nbsp;&nbsp;2. One not restrained by moral principles; an unscrupulous villain.<br>&nbsp;&nbsp;&nbsp;3. One who holds a false religious belief; a misbeliever.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Lacking in conscience or moral principles; unscrupulous.<br>&nbsp;&nbsp;&nbsp;2. Holding an incorrect religious belief.<br>", "etymology": "1350–1400; Middle English < Middle French mescreant unbelieving, equivalent to mes- mis- 1 + creant ≪ Latin crēdent- credent", "example": "Owner Harold ran an effective, efficient business, but the parking lot became an attractive nuisance for miscreants.", "synonym": "criminal"}, {"word": "scalawag", "definitionA": "a scamp; rascal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A scrawny cow.<br>&nbsp;&nbsp;&nbsp;2. A rascal.<br>&nbsp;&nbsp;&nbsp;3. Any white Southerner who supported the federal plan of Reconstruction after the American Civil War or who joined with the black freedmen and the carpetbaggers in support of Republican Party policies.<br>", "etymology": "An Americanism dating back to 1840–50; origin uncertain", "example": "Eddie Haskell Santorum is supposed to get the evangelical vote what with his Christian-right backing, not the scalawag Newt.", "synonym": "caitiff"}, {"word": "varlet", "definitionA": "a knavish person; rascal.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A servant or attendant.<br>&nbsp;&nbsp;&nbsp;2. Specifically, a youth acting as a knight's attendant at the beginning of his training for knighthood.<br>&nbsp;&nbsp;&nbsp;3. A rogue or scoundrel.<br>&nbsp;&nbsp;&nbsp;4. The jack.<br>", "etymology": "1425–75; late Middle English < Middle French; variant of valet", "example": "He had been regarding with interest a shackled-kneed varlet holding a halberd in his arms as if it had been a fractious bairn.", "synonym": "blackguard"}]
